Repository: nicklambson/bitcoin-multilingual
Catalog: alignments/bitcoin-is-time/Bitcoin is Time_es.tmx
Source language: en_us
Languages: es

source: It also doesn’t matter that we have no absolute reference frame in the first place.
es: Tampoco importa que no tengamos un marco de referencia absoluto en primer lugar.

source: They only have to be precise enough to calculate a somewhat reliable average across 2016 blocks.
es: Sólo tienen que ser lo suficientemente precisos como para calcular un promedio algo confiable a lo largo de 2016 bloques.

source: To guarantee that, a block’s “meatspace” timestamp is only accepted if it fulfills two criteria:
es: Para garantizar esto, una marca de tiempo de bloque sólo es aceptada si cumple con los siguientes dos criterios:

source: The timestamp has to be greater than the median timestamp of the previous 11 blocks.
es: La marca de tiempo tiene que ser mayor a la marca de tiempo promedio de los 11 bloques previos.

source: The timestamp has to be less than the network-adjusted time plus two hours.
es: La marca de tiempo tiene que ser menor que la hora fijada por la red más dos horas.

source: (The “network-adjusted time” is simply the median of the timestamps returned by all nodes connected to you.)
es: (El “tiempo ajustado por la red” es simplemente la mediana de las marcas de tiempo devueltas por todos los nodos conectados a ti).

source: In other words, the difficulty-adjustment is about keeping a constant time, not a constant level of security, difficulty, or energy expenditure.
es: En otras palabras, la dificultad de ajuste se trata de mantener un tiempo constante, no un nivel constante de seguridad, dificultad o gasto de energía.

source: This is ingenious because good money has to be costly in time, not energy.
es: Esto es ingenioso porque el buen dinero tiene que ser costoso en tiempo, no en energía.

source: Linking money to energy alone is not sufficient to produce absolute scarcity since every improvement in energy generation would allow us to create more money.
es: Enlazar el dinero a la energía por sí sola no es suficiente para producir escasez absoluta ya que cada mejora en la generación de energía nos permitiría crear más dinero.

source: Time is the only thing we will never be able to make more of.
es: El tiempo es la única cosa que nosotros jamás seremos capaces de generar.

source: It is The Ultimate Resource, as Julian Simon points out.
es: Este es el “recurso último”, como afirma Julian Simon.

source: This makes Bitcoin the ultimate form of money because its issuance is directly linked to the ultimate resource of our universe: time.
es: Esto es lo que hace que Bitcoin sea la última forma de dinero porque su emisión está directamente ligada al recurso fundamental del universo: el tiempo.

source: The difficulty adjustment is essential because, without it, the internal clock of Bitcoin would tend to go faster and faster as more miners join the network or the efficiency of mining devices improves.
es: El ajuste por dificultad es esencial porque sin él, el reloj interno de Bitcoin tendería a ir cada vez más rápido cuando más mineros se unen a la red o cuando mejora la eficiencia de los dispositivos usados para minar.

source: We would quickly run into the coordination problem that Bitcoin sets out to solve.
es: Rápidamente nos encontraríamos con el problema de coordinación que Bitcoin se propone resolver.

source: As soon as the block time falls below a certain threshold, say, 50 milliseconds, it would be impossible to agree on a shared state, even in theory.
es: Tan pronto como el tiempo de bloque cae por debajo de un cierto umbral, digamos 50 milisegundos, sería imposible ponerse de acuerdo en un estado compartido, aún en la teoría.

source: It takes light around 66 milliseconds to travel from one side of the earth to the other.
es: A la luz le toma 66 milisegundos viajar desde un lado de la Tierra hacia el otro.

source: Thus, even if our computers and routers were perfect, we would be back at square one:
es: Entonces, incluso si nuestras computadoras y routers fueran perfectos, volveríamos a la primera casilla:

source: given two events, it would be futile to tell which event happened before and which event happened after.
es: dados dos eventos, sería fútil decir qué evento ocurrió antes y cuál después.

source: Without a periodic adjustment of Bitcoin’s ticks, we would run into the hopeless problem of solving the coordination problem faster than the speed of light.
es: Sin un ajuste periódico de los ticks de Bitcoin, nos encontraríamos en el problema desesperanzador de coordinar más rápido que la velocidad de la luz.

source: Time is also at the root of the problem of cryptographic instability, which was outlined in Chapter 1.
es: El tiempo también es la raíz del problema de la inestabilidad de la criptografía, que fue señalado en el Capítulo 1.

source: Cryptography works because of an asymmetry in time:
es: La criptografía funciona gracias a una asimetría en el tiempo:

source: it takes a short time to build a cryptographic wall and a long time to break it down — unless you have a key.
es: toma poco tiempo construir un muro criptográfico mientras que destruirlo lleva mucho tiempo -a menos que tengas una llave.

source: Thus, in some sense, proof-of-work — and the difficulty adjustment that goes along with it — artificially slows down time, at least from the perspective of the Bitcoin network.
es: Entonces, en cierto sentido, la prueba de trabajo - y el ajuste por dificultad que va con esto- desacelera el tiempo de forma artificial, por lo menos desde la perspectiva de la red de Bitcoin.

source: Bitcoin enforces an internal rhythm whose low frequency allows ample buffer for the latency of communications between peers.
es: Bitcoin impone un ritmo interno cuya baja frecuencia permite un búfer amplio para la latencia de las comunicaciones entre pares.

source: Every 2016 blocks, Bitcoin’s internal clock readjusts, so that — on average — only one valid block will be found every 10 minutes.
es: Cada 2016 bloques, el reloj interno de Bitcoin se reajusta, por lo que, en promedio, un bloque válido sólo será hallado cada 10 minutos.

source: From an outside perspective, Bitcoin funnels the chaotic mess of globally broadcast asynchronous messages into a parallel universe, restricted by its own rules and its own sense of space and time.
es: Desde una perspectiva externa, Bitcoin canaliza el desorden caótico de los mensajes asincrónicos transmitidos globalmente en un universo paralelo, restringido por sus propias reglas y su propio sentido del espacio y tiempo.

source: Transactions in the mempool are timeless from the point-of-view of the Bitcoin network.
es: Las transacciones en la memoria de los nodos de la red son atemporales desde el punto de vista de la red Bitcoin.

source: Only when a transaction is included in a valid block does it get assigned a time:
es: Solo cuando una transacción se incluye en un bloque válido, se le asigna un tiempo:

source: the number of the block it is included in.
es: el número del bloque en el que está incluida.

source: BitCoin v0.01 ALPHA (2009)
es: bitcoin alpha codigo fuente BitCoin v0.01 ALPHA (2009)

source: It is hard to overstate how elegant a solution this is.
es: Es difícil exagerar lo elegante que es esta solución.

source: Once you are able to create your own definition of time, deciphering what came before and what came after is trivial.
es: Una vez que eres capaz de crear tu propia definición de tiempo, descifrar lo que vino antes y lo que vino después es trivial.

source: In turn, agreeing on what happened, in what order, and, consequently, who owes what to whom, becomes trivial as well.
es: Sucesivamente, ponerse de acuerdo sobre lo que sucedió, en qué orden y, consecuentemente, quién le debe qué a quién, se vuelve también trivial.

source: The difficulty adjustment makes sure that the ticks of Bitcoin’s internal metronome are somewhat constant.
es: El ajuste por dificultad asegura que los ticks del metrónomo interno de Bitcoin sean algo constante.

source: It is the conductor of the Bitcoin orchestra.
es: Es el conductor de la orquesta de Bitcoin.

source: It is what keeps the music alive.
es: Es lo que mantiene a la música viva.

source: But why can we rely on work in the first place?
es: Pero, ¿por qué podemos confiar en el trabajo en primer lugar?

source: The answer is threefold.
es: La respuesta es triple.

source: We can rely on it because computation requires work, work requires time, and the work in question — guessing random numbers — can not be done efficiently.
es: Podemos confiar en él porque el cálculo requiere trabajo, el trabajo requiere tiempo, y el trabajo en cuestión -adivinar números aleatorios- no puede hacerse eficientemente.

source: Probabilistic Time Time forks perpetually toward innumerable futures.
es: Tiempo probabilístico “El tiempo se bifurca perpetuamente hacia innumerables futuros.”

source: Jorge Luis Borges, The Garden of Forking Paths (1941)
es: - Jorge Luis Borges, El jardín de los senderos que se bifurcan (1958).

source: Finding a valid nonce for a Bitcoin block is a guessing game.
es: Encontrar un número válido para un bloque de Bitcoin es un juego de adivinanzas.

source: It is very much like rolling a die, or flipping a coin, or spinning a roulette wheel.
es: Es muy parecido a girar un dado, o lanzar una moneda, o hacer girar la rueda de una ruleta.

source: You are, in essence, trying to find a beyond-astronomically large random number.
es: En esencia, estás tratando de encontrar un número aleatorio más allá de lo astronómicamente grande.

source: There is no progress toward finding a solution.
es: No hay progreso hacia la búsqueda de una solución.

source: You either hit the jackpot, or you don’t.
es: O ganas el premio o no lo haces.

source: Every time you flip a coin, the chance of it coming up heads or tails is 50% — even if you flipped it twenty times before, and it came up heads every time.
es: Cada vez que lanzas una moneda, la posibilidad de que salga cara o cruz es 50% - incluso si ya la lanzaste veinte veces antes, y siempre salió cara.

source: Similarly, every time you wait for a bitcoin block to come in, the chance that it will be found this second is ~0.16%.
es: De forma similar, cada vez que esperas que llegue un bloque de Bitcoin, la chance de que sea encontrado ese segundo es ~0.16%.

source: It doesn’t matter when the last block was found.
es: No importa cuando fue hallado el último bloque.

source: The approximate waiting time for the next block is always the same:
es: El tiempo aproximado de espera para el siguiente bloque es siempre el mismo:

source: ~10 minutes.
es: ~10 minutos.

source: It follows that every individual tick of this clock is unpredictable.
es: Resulta que cada tick individual de este reloj es impredecible.

source: Relative to our human clocks, this clock appears to be spontaneous and imprecise.
es: En relación a los relojes humanos, este reloj parece ser espontáneo e impreciso.

source: This is irrelevant, as Gregory Trubetskoy points out:
es: Esto es irrelevante, como señala Gregory Trubetskoy:

source: “It doesn’t matter that this clock is imprecise.
es: “No importa que este reloj sea impreciso.

source: What matters is that it is the same clock for everyone and that the state of the chain can be tied unambiguously to the ticks of this clock.”
es: Lo que importa es que es el mismo reloj para todos y que el estado de la cadena puede ser vinculado inequívocamente a los ticks de este reloj”.

source: Bitcoin’s clock might be probabilistic, but it isn’t illusory.
es: Puede que el reloj de Bitcoin sea probabilístico, pero no es ilusorio.

source: Time is an illusion, lunchtime doubly so.
es: “El tiempo es una ilusión, Y la hora del almuerzo lo es el doble.”

source: The present moment, however, can absolutely be an illusion in Bitcoin.
es: El momento presente, sin embargo, puede ser una absoluta ilusión en Bitcoin.

source: Since there is no central authority in the network, strange situations can arise.
es: Como no hay autoridad central en la red, pueden surgir extrañas situaciones.

source: While unlikely, it is possible that a valid block is found at the same time (again: apologies to all physicists), which will make the clock tick forward in two different places at once.
es: Aunque es poco probable, es posible que un bloque válido sea hallado al mismo tiempo (de nuevo: disculpas a todos los físicos), haciendo que el reloj avance en dos lugares diferentes a la vez.

source: However, since the two different blocks will very likely differ in their content, they will contain two different histories, both equally valid.
es: Sin embargo, como dos bloques diferentes seguramente difieren en su contenido, van a contener dos historias diferentes igualmente válidas.

source: This is known as a chain split and is a natural process of Nakamoto consensus.
es: A esto se le llama “división de la cadena” y es un proceso natural del consenso de Nakamoto.

source: Like a flock of birds that briefly splits in two only to merge again, nodes on the Bitcoin network will eventually converge to a shared history after some time, thanks to the probabilistic nature of guessing.
es: Como una bandada de aves que se separa brevemente en dos y luego se juntan de nuevo, los nodos de la red de bitcoin eventualmente convergen a una historia compartida luego de algún tiempo, gracias a la naturaleza probabilística de adivinar.

source: Nakamoto consensus simply states that the correct history is to be found in the heaviest chain, i.e., the chain with the most amount of proof-of-work embedded in it.
es: El consenso de Nakamoto simplemente establece que la historia correcta será hallada en la cadena más pesada, es decir, la cadena que contenga la mayor cantidad de prueba de trabajo.

source: Thus, if we have two histories A and B, some miners will try to build upon history A, others will try to build upon history B.
es: Por lo tanto, si tenemos dos historias A y B, algunos mineros van a tratar de construir sobre la historia A y otros sobre la historia B.

source: As soon as one of them finds the next valid block, the other group is programmed to accept that they were on the wrong side of history and switch over to the heaviest chain — the chain that represents what actually happened, by definition.
es: Pero tan pronto como uno de ellos encuentre el próximo bloque válido, el otro grupo está programado para aceptar que ellos estaban en el lado incorrecto de la historia y cambiar hacia la cadena más pesada - la cadena que representa lo que realmente sucedió, por definición.

source: In Bitcoin, history is truly written by the victors.
es: En Bitcoin, la historia está verdaderamente escrita por los vencedores.

source: The payee needs proof that at the time of each transaction, the majority of nodes agreed it was the first received.
es: “El beneficiario necesita prueba de que al momento de cada transacción, la mayoría de los nodos acordaron que fue la primera recibida

source: When there are multiple double-spent versions of the same transaction, one and only one will become valid.
es: Cuando hay múltiples versiones de doble gasto de la misma transacción, una y sólo usa será válida.

source: The receiver of a payment must wait an hour or so before believing that it’s valid.
es: El receptor de un pago debe esperar una hora o más antes de pensar que es válida.

source: The network will resolve any possible double-spend races by then.
es: Para ese entonces, la red resolverá cada posible carrera de doble gasto.

source: In this simple statement lies the secret of the distributed coordination problem.
es: En esta simple oración reside el secreto del problema de la coordinación distribuida.

source: This is how Satoshi solved the problem of the “simultaneous payment” our fictitious business partners encountered previously.
es: Así es como Satoshi resolvió el problema del “pago simultáneo” que nuestros compañeros de negocio ficticios encontraron previamente.

source: He solved it once and for all, relativistic effects be damned!
es: Él lo resolvió de una vez por todas, ¡y al diablo los efectos relativistas!

source: Because of this probabilistic nature of Bitcoin’s clock, the present moment — what we call the chain tip — is always uncertain.
es: Debido a esta naturaleza probabilística del reloj de Bitcoin, el momento presente - lo que nosotros llamamos la punta de la cadena - es siempre incierto.

source: The past — blocks buried below the chain tip — is ever more certain.
es: El pasado -bloques enterrados bajo la punta de la cadena - es cada vez más cierto.

source: The more thorough the understanding needed, the further back in time one must go.
es: Mientras más quieres saber, más atrás en el tiempo uno debe ir.

source: Gordon Clark, A Christian View of Men and Things, p. 58. (1951)
es: - Gordon Clark, Una mirada cristiana del Hombre y las Cosas, p. 58. (1951)

source: Consequently, the Bitcoin clock might rewind from time to time, for some peers, for a tick or two.
es: Consecuentemente, el reloj de Bitcoin puede rebobinar de cuando en cuando, para algunos pares, por un tick o dos.

source: If your chain tip — the present moment — happens to lose to a competing chain tip, your clock will first rewind and then jump forward, overriding the last few ticks that you thought were history already.
es: Si a tu punta de la cadena -el momento presente- le toca perder contra otra punta de la cadena, tu reloj va a rebobinar y luego saltar hacia adelante, reemplazando los pocos ticks que tu ya creías parte de la historia.

source: If your clock is probabilistic, your understanding of the past has to be too.
es: Si tu reloj es probabilístico, tu entendimiento del pasado también debe serlo.

source: Tick tock tick tock tick — what is the time?
es: Tick tock tick tock tick - ¿Que hora es?

source: Tick tock tick tock… it ends in c619.
es: Tick tock tick tock… termina en c619.

source: Are you sure this is fine?
es: ¿Estás seguro de que está bien?

source: Are we probably late?
es: ¿Llegamos tarde?

source: Absolutes do not matter:
es: No importa en absoluto:

source: before nine there comes eight.
es: antes de las nueve vienen las ocho.

source: The clock isn’t exact; it sometimes goes in reverse.
es: El reloj no es exacto; a veces va en reversa.

source: Exact time implies center; that’s the root of this curse!
es: Tiempo exacto implica centro; esa es la causa de esta maldición!

source: Yet this clock keeps on ticking, tock-tick and tick-tock, there’s no profit in tricking; just tick-tock and next block.
es: Pero este reloj se mantiene funcionando, tock-tick y tick-tock, No hay ganancia en hacer trucos; solo tick-tock y al siguiente bloque

source: A Funny Little Rhyme on Bitcoin and Time (2020)
es: Una Divertida Rima sobre Bitcoin y Tiempo (2020)

source: Conclusion
es: Conclusión

source: Time is still one of the great mysteries in physics, one that calls into question the very definition of what physics is.
es: El tiempo es aún uno de los grandes misterios de la física, uno que cuestiona la definición misma de lo que es la física.

source: Jorge Cham and Daniel Whiteson:
es: - Jorge Cham y Daniel Whiteson:

source: We Have No Idea:
es: No Tenemos Idea:

source: A Guide to the Unknown Universe, pp. 117 – 118 (2017)
es: Una Guía hacia el Universo Desconocido, pp. 117-118 (2017).

source: Keeping track of things in the informational realm implies keeping track of a sequence of events, which in turn requires keeping track of time.
es: Seguir el rastro de las cosas en el reino informático implica rastrear una secuencia de eventos, que a su vez requieren rastrear el tiempo.

source: Keeping track of time requires agreeing on a “now” — a moment in time that eternally links the settled past with the uncertain future.
es: Hacer un seguimiento del tiempo requiere coincidir en un “ahora” - un momento en el tiempo que une eternamente el pasado con el futuro incierto.

source: In Bitcoin, this “now” is the tip of the heaviest proof-of-work chain.
es: En Bitcoin, este “ahora” es la punta de la cadena de prueba de trabajo más pesada.

source: Two building blocks are essential for the structure of time: causal links and unpredictable events.
es: Dos bloques de construcción son esenciales para la estructura del tiempo: uniones causales y eventos impredecibles.

source: Causal links are required to define a past, and unpredictable events are required to build a future.
es: Uniones causales son necesarias para definir un pasado, y eventos impredecibles son requeridos para construir un futuro.

source: If the sequence of events would be predictable, it would be possible to skip ahead.
es: Si la secuencia de eventos fuera predecible, sería posible saltar hacia adelante.

source: If the individual steps of the sequence aren’t linked, it would be trivial to change the past.
es: Si los pasos individuales de la secuencia no están unidos, sería trivial cambiar el pasado.

source: Because of its internal sense of time, it is insanely difficult to cheat Bitcoin.
es: Debido a su sentido interno del tiempo, es increíblemente difícil engañar a Bitcoin.

source: One would have to rewrite the past or predict the future.
es: Uno tendría que reescribir el pasado o predecir el futuro.

source: Bitcoin’s timechain prevents both.
es: La cadena de tiempo de Bitcoin evita ambos.

source: Viewing Bitcoin through the lens of time should make clear that the “block chain” — the data structure that causally links multiple events together — is not the main innovation.
es: Ver a Bitcoin a través de los lentes del tiempo debería esclarecer que la “blockchain” - la estructura de datos que une causalmente a múltiples eventos juntos- no es la mayor innovación.

source: It is not even a new idea, as is evident by studying the timestamp literature of the past.
es: Ni siquiera es una idea nueva, ya que es evidente al estudiar la literatura que se ha publicado con anterioridad.

source: A blockchain is a chain of blocks.
es: Una blockchain es una cadena de bloques.

source: What is a new idea — what Satoshi figured out — is how to independently agree upon a history of events without central coordination.
es: La nueva idea -lo que descubrió Satoshi- es cómo estar de acuerdo de forma independiente sobre una historia de eventos sin una coordinación central.

source: He found a way to implement a decentralised timestamping scheme that (a) doesn’t require a time-stamping company or server, (b) doesn’t require a newspaper or any other physical medium as proof, and (c) can keep the ticks more-or-less constant, even when operating in an environment of ever-faster CPU clock times.
es: Él halló la forma de implementar un esquema de marcado de hora descentralizado que a) no requiere una compañía o servidor que marque la hora, b) no requiere de ningún periódico u otro medio físico como prueba, y c) puede mantener el tick-tack del reloj más o menos constante, incluso cuando se opera en un entorno con tiempos de reloj de CPU cada vez más rápidos.

source: Timekeeping requires causality, unpredictability, and coordination.
es: El cronometraje requiere causalidad, impredecibilidad y coordinación.

source: In Bitcoin, causality is provided by one-way functions: the cryptographic hash functions and digital signatures that are at the core of the protocol.
es: En Bitcoin, la causalidad es brindada por dos funciones unidireccionales: la criptografía hash y las firmas digitales que son el corazón del protocolo.
